# GetVPClOvrdCount

## Description
Returns the number of class overrides associated with a particular viewport.

```pascal
FUNCTION GetVPClOvrdCount(viewportHandle : HANDLE): INTEGER;
```

```python
def vs.GetVPClOvrdCount(viewportHandle):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|viewportHandle|HANDLE|The viewport handle.|

## See Also
VS Functions:
GetVPClOvrdName

## Version
Availability: from Vectorworks 2014

## Category
* Viewports